In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sb

Data visualization

In [2]:
df = pd.read_csv("ds_salaries.csv")
df.drop(columns='Unnamed: 0', inplace=True)
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

Filter columns and get unique values

In [10]:
dic_unique = {}
filters = ["work_year", "experience_level", "employment_type", "job_title", "employee_residence", "company_location", "company_size"]
for element in filters:
    dic_unique[element] = list(df[element].unique())

Analyze data type and convert object to strings

In [4]:
df.dtypes

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [11]:
string_col = df.select_dtypes(include="object").columns
df[string_col]=df[string_col].astype("string")
df.dtypes

work_year              int64
experience_level      string
employment_type       string
job_title             string
salary                 int64
salary_currency       string
salary_in_usd          int64
employee_residence    string
remote_ratio           int64
company_location      string
company_size          string
dtype: object

Group salaries by years and get the min, max and mean values

In [12]:
dic_unique

{'work_year': [2020, 2021, 2022],
 'experience_level': ['MI', 'SE', 'EN', 'EX'],
 'employment_type': ['FT', 'CT', 'PT', 'FL'],
 'job_title': ['Data Scientist',
  'Machine Learning Scientist',
  'Big Data Engineer',
  'Product Data Analyst',
  'Machine Learning Engineer',
  'Data Analyst',
  'Lead Data Scientist',
  'Business Data Analyst',
  'Lead Data Engineer',
  'Lead Data Analyst',
  'Data Engineer',
  'Data Science Consultant',
  'BI Data Analyst',
  'Director of Data Science',
  'Research Scientist',
  'Machine Learning Manager',
  'Data Engineering Manager',
  'Machine Learning Infrastructure Engineer',
  'ML Engineer',
  'AI Scientist',
  'Computer Vision Engineer',
  'Principal Data Scientist',
  'Data Science Manager',
  'Head of Data',
  '3D Computer Vision Researcher',
  'Data Analytics Engineer',
  'Applied Data Scientist',
  'Marketing Data Analyst',
  'Cloud Data Engineer',
  'Financial Data Analyst',
  'Computer Vision Software Engineer',
  'Director of Data Engineering',
  'Data Science Engineer',
  'Principal Data Engineer',
  'Machine Learning Developer',
  'Applied Machine Learning Scientist',
  'Data Analytics Manager',
  'Head of Data Science',
  'Data Specialist',
  'Data Architect',
  'Finance Data Analyst',
  'Principal Data Analyst',
  'Big Data Architect',
  'Staff Data Scientist',
  'Analytics Engineer',
  'ETL Developer',
  'Head of Machine Learning',
  'NLP Engineer',
  'Lead Machine Learning Engineer',
  'Data Analytics Lead'],
 'employee_residence': ['DE',
  'JP',
  'GB',
  'HN',
  'US',
  'HU',
  'NZ',
  'FR',
  'IN',
  'PK',
  'PL',
  'PT',
  'CN',
  'GR',
  'AE',
  'NL',
  'MX',
  'CA',
  'AT',
  'NG',
  'PH',
  'ES',
  'DK',
  'RU',
  'IT',
  'HR',
  'BG',
  'SG',
  'BR',
  'IQ',
  'VN',
  'BE',
  'UA',
  'MT',
  'CL',
  'RO',
  'IR',
  'CO',
  'MD',
  'KE',
  'SI',
  'HK',
  'TR',
  'RS',
  'PR',
  'LU',
  'JE',
  'CZ',
  'AR',
  'DZ',
  'TN',
  'MY',
  'EE',
  'AU',
  'BO',
  'IE',
  'CH'],
 'company_location': ['DE',
  'JP',
  'GB',
  'HN',
  'US',
  'HU',
  'NZ',
  'FR',
  'IN',
  'PK',
  'CN',
  'GR',
  'AE',
  'NL',
  'MX',
  'CA',
  'AT',
  'NG',
  'ES',
  'PT',
  'DK',
  'IT',
  'HR',
  'LU',
  'PL',
  'SG',
  'RO',
  'IQ',
  'BR',
  'BE',
  'UA',
  'IL',
  'RU',
  'MT',
  'CL',
  'IR',
  'CO',
  'MD',
  'KE',
  'SI',
  'CH',
  'VN',
  'AS',
  'TR',
  'CZ',
  'DZ',
  'EE',
  'MY',
  'AU',
  'IE'],
 'company_size': ['L', 'S', 'M']}

In [17]:
range(1,20, 3)

range(1, 20, 3)